m/crystal/src/org/uni_notes/architecture1.org
#+title: Architecture 1
#+AUTHOR: Crystal
#+OPTIONS: ^:{}
#+OPTIONS: num:nil
#+EXPORT_FILE_NAME: ../../../uni_notes/architecture.html
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../src/css/colors.css"/>
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../src/css/style.css"/>
#+OPTIONS: html-style:nil
#+OPTIONS: toc:4
#+OPTIONS: \n:y
#+HTML_LINK_HOME: https://crystal.tilde.institute/
#+HTML_HEAD: <link rel="icon" type="image/x-icon" href="https://crystal.tilde.institute/favicon.png">
#+HTML_LINK_UP: ../../../uni_notes/

* Premier cours : Les systémes de numération /Sep 27/ :
Un système de numération est une méthode pour représenter des nombres à l'aide de symboles et de règles. Chaque système, comme le décimal (base 10) ou le binaire (base 2), utilise une base définie pour représenter des valeurs numériques. Il est caractérisé par 3 entitiés mathématiques importantes:

 1. Une base (genre 10, ou 2)
 2. Un ensemble de chiffres
 3. Des régles de représentations des nombres

*** *Examples :*
/B10 est un systéme de numération caractérisé par:/
- Base = 10
- Un ensemble de chiffres : (0,1,2,3,4,5,6,7,8,9)

/B16 est un autre systéme de numération caractérisé par:/
- Base = 16
- Un ensemble de chiffres : (0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F)

  *Puisse-qu'on peut pas utiliser des nombres a deux chiffres, on utilise des lettres aprés 9, en leur donnant des valeurs tel que :*

   A : 10 ; B : 11 ; C : 12 ; D : 13 ; E : 14 ; F : 15

** Comment passer d'un systéme a base 10 a un autre

On symbolise un chiffre dans la base x par : (Nombre)x

*** Pour les chiffres entiers :
*On fait une division successive, on prends le nombre 3257 comme exemple, on veut le faire passer d'une base décimale á une base 16:*


(3257)10 ----> (?)16


On dévise 3257 par 16, et les restants de la division serra la valeur en base16:

3257/16 = 203 + *9* / 16

203/16 = 12 + *B* / 16  /REMARQUE, 11 N'APPARTIENS PAS A L'ENSEMBLE DES CHIFFRES EN BASE16, CE QUI VEUT DIRE QU'ON LE REMPLACE PAR SON EQUIVALENT, DANS CE CAS LA: *B*/

12/16 = 0 + *C* / 16 /Pareil ici, 12 n'existe pas, donc c'est C. Autre note : La division s'arréte quand le résultat de la division est nul/

**** *Conclusion:*

(3257)10 ----> (CB9)16

*** Pour les chiffres non entiers :

*On fait la division successive pour la partie entiére, et une multiplication successive pour la partie rationelle:*

(3257,32)10 ----> (?)16

On a déja la partie entiére donc on s'occupe de la partie aprés la virgule:

0,32 x 16 = *5*,12

0,12 x 16 = *1*,92

0,92 x 16 = *E*,72 /On a pas de 15 donc c'est un E/

0,72 x 16 = *B*,52

0,52 x 16 = *8*,32

0,32 x 16 = *5*,12

...

/On s'arréte quand on trouve un chiffre entier, et si on trouve pas, on s'arréte quand on remarque une répetition, dans ce cas la, la séquance 51EB8 vas se répéter indéfiniment, donc on se contente d'écrire la partie qui se répéte avec une barre en haut/


(3257,32)10 ----> (CB9, _51EB8_)16


* 2nd cours : Les systèmes de numération (Suite) /Oct 3/ :
** Comment passer d'une base N a la base 10 :

Prenons comme exemple le nombre (11210,0011)3 , chaque chiffre dans ce nombre a un rang qui commence par 0 au premier chiffre (a gauche de la virgule) et qui augmente d'un plus qu'on avance a gauche, et diminue si on part a droite. Dans ce cas la :


(11210,0011)3 ; le 0 est de rang 0, le 1 est de rang 1, le 2 est de rang 2, le 1 est de rang 3, le 1 est de rang 4. Et si on part du coté de la virgule, 0 est de rang -1, 0 est de rang -2, le 1 est de rang -3, et le 1 est de rang -4.


Et pour passer a la base 10, il suffit d'appliquer cette formule : *Chiffre x Base^(rang) + 2emeChiffre x Base^(rang)... etc*, donc dans notre example:


/0 x 3° + 1 x 3¹ + 2 x 3² + 1 x 3³ + 1 x 3^4 + 0 x 3¯¹ + 0 x 3¯² + 1 x 3¯³ + 1 x 3^(-4) ≈ (129,05)10/


** Comment passer d'une base N a une base N^(n) :

Si il ya une relation entre une base et une autre, on peut directement transformer vers cette base.

*** Exemple :
Pour passer de la base 2 a la base 8 (8 qui est 2³) on découpe les chiffres 3 par 3


(1 101 011, 011)2 ; Pour le dernier 1 qui est seul ~tout comme moi~ il suffit d'ajouter des 0 à gauche (car on peut) pour compléter le découpage.


(001 101 011, 011)2; Next step c'est de dessiner le tableau de conversion de la base 2 a la base 8 ( un tableau a 3 bits )


| N |   |   |   |
|---+---+---+---|
| 0 | 0 | 0 | 0 |
| 1 | 0 | 0 | 1 |
| 2 | 0 | 1 | 0 |
| 3 | 0 | 1 | 1 |
| 4 | 1 | 0 | 0 |
| 5 | 1 | 0 | 1 |
| 6 | 1 | 1 | 0 |
| 7 | 1 | 1 | 1 |


Pour remplir on a qu'a diviser les chiffres en deux, et mettre des 0 dans la première partie et des 1 dans la 2éme, et en faire de même pour les autres colonnes .


Maintenant il suffit de trouver l'équivalent de la base2 en base8 :


001 c'est 1 ; 101 c'est 5 ; 011 c'est 3 ; donc *(1101011,011)2 ---> (153,3)8*

** L'arithmétique binaire :
