m/crystal/uni_notes/architecture.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-11-01 Wed 20:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Architecture 1</title>
<meta name="author" content="Crystal" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../src/css/colors.css"/>
<link rel="stylesheet" type="text/css" href="../src/css/style.css"/>
<link rel="icon" type="image/x-icon" href="https://crystal.tilde.institute/favicon.png">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../../../uni_notes/"> UP </a>
 |
 <a accesskey="H" href="https://crystal.tilde.institute/"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Architecture 1</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org3fa8932">Premier cours : Les systémes de numération <i>Sep 27</i> :</a>
<ul>
<li>
<ul>
<li><a href="#orgb23a1f3"><b>Examples :</b></a></li>
</ul>
</li>
<li><a href="#orga02a1f6">Comment passer d&rsquo;un systéme a base 10 a un autre</a>
<ul>
<li><a href="#org8c7a5f5">Pour les chiffres entiers :</a></li>
<li><a href="#org6378ac0">Pour les chiffres non entiers :</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org251a561">2nd cours : Les systèmes de numération (Suite) <i>Oct 3</i> :</a>
<ul>
<li><a href="#org2a38085">Comment passer d&rsquo;une base N a la base 10 :</a></li>
<li><a href="#orgc0fdca1">Comment passer d&rsquo;une base N a une base N^(n) :</a>
<ul>
<li><a href="#orgba624be">Exemple :</a></li>
</ul>
</li>
<li><a href="#org789d800">L&rsquo;arithmétique binaire :</a>
<ul>
<li><a href="#orgac84614">L&rsquo;addition :</a></li>
<li><a href="#org4829f28">La soustraction :</a></li>
</ul>
</li>
<li><a href="#org110b8dd">TP N°1 :</a>
<ul>
<li><a href="#org54d7fdf">Exo1:</a></li>
<li><a href="#org6654eb2">Exo2:</a></li>
<li><a href="#org9da39d0">Exo3:</a></li>
</ul>
</li>
<li><a href="#org2039fb1">L&rsquo;arithmétique binaire (Suite): <i>Oct 4</i></a>
<ul>
<li><a href="#orgfc45d53">La multiplication :</a></li>
<li><a href="#org91fcccc">La division :</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgcbf8da9">4th cours : Le codage <i>Oct 10</i></a>
<ul>
<li><a href="#org34693c1">Le codage des entiers positifs</a></li>
<li><a href="#org3c8ed5c">Le codage des nombres relatifs</a>
<ul>
<li><a href="#orgb2d4951">Remarque</a></li>
<li><a href="#orgca1d761">Le codage en signe + valeur absolue (SVA):</a></li>
<li><a href="#orgd2c678f">Codage en compliment a 1 (CR):</a></li>
<li><a href="#org9961620">Codage en compliment a 2 (CV):</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org3fa8932" class="outline-2">
<h2 id="org3fa8932">Premier cours : Les systémes de numération <i>Sep 27</i> :</h2>
<div class="outline-text-2" id="text-org3fa8932">
<p>
Un système de numération est une méthode pour représenter des nombres à l&rsquo;aide de symboles et de règles. Chaque système, comme le décimal (base 10) ou le binaire (base 2), utilise une base définie pour représenter des valeurs numériques. Il est caractérisé par 3 entitiés mathématiques importantes:<br />
</p>

<ol class="org-ol">
<li>Une base (genre 10, ou 2)<br /></li>
<li>Un ensemble de chiffres<br /></li>
<li>Des régles de représentations des nombres<br /></li>
</ol>
</div>
<div id="outline-container-orgb23a1f3" class="outline-4">
<h4 id="orgb23a1f3"><b>Examples :</b></h4>
<div class="outline-text-4" id="text-orgb23a1f3">
<p>
<i>B10 est un systéme de numération caractérisé par:</i><br />
</p>
<ul class="org-ul">
<li>Base = 10<br /></li>
<li>Un ensemble de chiffres : (0,1,2,3,4,5,6,7,8,9)<br /></li>
</ul>

<p>
<i>B16 est un autre systéme de numération caractérisé par:</i><br />
</p>
<ul class="org-ul">
<li>Base = 16<br /></li>
<li><p>
Un ensemble de chiffres : (0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F)<br />
</p>

<p>
<b>Puisse-qu&rsquo;on peut pas utiliser des nombres a deux chiffres, on utilise des lettres aprés 9, en leur donnant des valeurs tel que :</b><br />
</p>

<p>
A : 10 ; B : 11 ; C : 12 ; D : 13 ; E : 14 ; F : 15<br />
</p></li>
</ul>
</div>
</div>
<div id="outline-container-orga02a1f6" class="outline-3">
<h3 id="orga02a1f6">Comment passer d&rsquo;un systéme a base 10 a un autre</h3>
<div class="outline-text-3" id="text-orga02a1f6">
<p>
On symbolise un chiffre dans la base x par : (Nombre)x<br />
</p>
</div>
<div id="outline-container-org8c7a5f5" class="outline-4">
<h4 id="org8c7a5f5">Pour les chiffres entiers :</h4>
<div class="outline-text-4" id="text-org8c7a5f5">
<p>
<b>On fait une division successive, on prends le nombre 3257 comme exemple, on veut le faire passer d&rsquo;une base décimale á une base 16:</b><br />
</p>


<p>
(3257)10 -&#x2014;&gt; (?)16<br />
</p>


<p>
On dévise 3257 par 16, et les restants de la division serra la valeur en base16:<br />
</p>

<p>
3257/16 = 203 + <b>9</b> / 16<br />
</p>

<p>
203/16 = 12 + <b>B</b> / 16  <i>REMARQUE, 11 N&rsquo;APPARTIENS PAS A L&rsquo;ENSEMBLE DES CHIFFRES EN BASE16, CE QUI VEUT DIRE QU&rsquo;ON LE REMPLACE PAR SON EQUIVALENT, DANS CE CAS LA: <b>B</b></i><br />
</p>

<p>
12/16 = 0 + <b>C</b> / 16 <i>Pareil ici, 12 n&rsquo;existe pas, donc c&rsquo;est C. Autre note : La division s&rsquo;arréte quand le résultat de la division est nul</i><br />
</p>
</div>
<ul class="org-ul">
<li><a id="org9a466ee"></a><b>Conclusion:</b><br />
<div class="outline-text-5" id="text-org9a466ee">
<p>
(3257)10 -&#x2014;&gt; (CB9)16<br />
</p>
</div>
</li>
</ul>
</div>
<div id="outline-container-org6378ac0" class="outline-4">
<h4 id="org6378ac0">Pour les chiffres non entiers :</h4>
<div class="outline-text-4" id="text-org6378ac0">
<p>
<b>On fait la division successive pour la partie entiére, et une multiplication successive pour la partie rationelle:</b><br />
</p>

<p>
(3257,32)10 -&#x2014;&gt; (?)16<br />
</p>

<p>
On a déja la partie entiére donc on s&rsquo;occupe de la partie aprés la virgule:<br />
</p>

<p>
0,32 x 16 = <b>5</b>,12<br />
</p>

<p>
0,12 x 16 = <b>1</b>,92<br />
</p>

<p>
0,92 x 16 = <b>E</b>,72 <i>On a pas de 15 donc c&rsquo;est un E</i><br />
</p>

<p>
0,72 x 16 = <b>B</b>,52<br />
</p>

<p>
0,52 x 16 = <b>8</b>,32<br />
</p>

<p>
0,32 x 16 = <b>5</b>,12<br />
</p>

<p>
&#x2026;<br />
</p>

<p>
<i>On s&rsquo;arréte quand on trouve un chiffre entier, et si on trouve pas, on s&rsquo;arréte quand on remarque une répetition, dans ce cas la, la séquance 51EB8 vas se répéter indéfiniment, donc on se contente d&rsquo;écrire la partie qui se répéte avec une barre en haut</i><br />
</p>


<p>
(3257,32)10 -&#x2014;&gt; (CB9, <span class="underline">51EB8</span>)16<br />
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org251a561" class="outline-2">
<h2 id="org251a561">2nd cours : Les systèmes de numération (Suite) <i>Oct 3</i> :</h2>
<div class="outline-text-2" id="text-org251a561">
</div>
<div id="outline-container-org2a38085" class="outline-3">
<h3 id="org2a38085">Comment passer d&rsquo;une base N a la base 10 :</h3>
<div class="outline-text-3" id="text-org2a38085">
<p>
Prenons comme exemple le nombre (11210,0011)3 , chaque chiffre dans ce nombre a un rang qui commence par 0 au premier chiffre (a gauche de la virgule) et qui augmente d&rsquo;un plus qu&rsquo;on avance a gauche, et diminue si on part a droite. Dans ce cas la :<br />
</p>


<p>
(11210,0011)3 ; le 0 est de rang 0, le 1 est de rang 1, le 2 est de rang 2, le 1 est de rang 3, le 1 est de rang 4. Et si on part du coté de la virgule, 0 est de rang -1, 0 est de rang -2, le 1 est de rang -3, et le 1 est de rang -4.<br />
</p>


<p>
Et pour passer a la base 10, il suffit d&rsquo;appliquer cette formule : <b>Chiffre x Base^(rang) + 2emeChiffre x Base^(rang)&#x2026; etc</b>, donc dans notre example:<br />
</p>


<p>
<i>0 x 3° + 1 x 3¹ + 2 x 3² + 1 x 3³ + 1 x 3^4 + 0 x 3¯¹ + 0 x 3¯² + 1 x 3¯³ + 1 x 3^(-4) ≈ (129,05)10</i><br />
</p>
</div>
</div>
<div id="outline-container-orgc0fdca1" class="outline-3">
<h3 id="orgc0fdca1">Comment passer d&rsquo;une base N a une base N^(n) :</h3>
<div class="outline-text-3" id="text-orgc0fdca1">
<p>
Si il ya une relation entre une base et une autre, on peut directement transformer vers cette base.<br />
</p>
</div>
<div id="outline-container-orgba624be" class="outline-4">
<h4 id="orgba624be">Exemple :</h4>
<div class="outline-text-4" id="text-orgba624be">
<p>
Pour passer de la base 2 a la base 8 (8 qui est 2³) on découpe les chiffres 3 par 3<br />
</p>


<p>
(1 101 011, 011)2 ; Pour le dernier 1 qui est seul <code>tout comme moi</code> il suffit d&rsquo;ajouter des 0 à gauche (car on peut) pour compléter le découpage.<br />
</p>


<p>
(001 101 011, 011)2; Next step c&rsquo;est de dessiner le tableau de conversion de la base 2 a la base 8 ( un tableau a 3 bits )<br />
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">N</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
</tr>
</tbody>
</table>


<p>
Pour remplir on a qu&rsquo;a diviser les chiffres en deux, et mettre des 0 dans la première partie et des 1 dans la 2éme, et en faire de même pour les autres colonnes .<br />
</p>


<p>
Maintenant il suffit de trouver l&rsquo;équivalent de la base2 en base8 :<br />
</p>


<p>
001 c&rsquo;est 1 ; 101 c&rsquo;est 5 ; 011 c&rsquo;est 3 ; donc <b>(1101011,011)2 &#x2014;&gt; (153,3)8</b><br />
</p>
</div>
</div>
</div>
