m/crystal/src/org/uni_notes/architecture1.org
*** Remarque
Quelque soit le codage utilise, par convention le dernier bit est reserve pour le signe. ou 1 est negatif et 0 est positif.
*** Le codage en signe + valeur absolue (SVA):
Avec n bits le n eme est reserve au signe : [-(2^n-1)-1 , 2^n-1 -1]. Sur 8bits [-127, 127]

*** Codage en compliment a 1 (CR):
On obtiens le compliment a 1 d'un nombre binaire en inversant chaqu'un de ses bits (1 -> 0 et 0-> 1) les nombres positifs sont la meme que SVA (il reste tel qu'il est)
*** Codage en compliment a 2 (CV):
C'est literallement CR + 1 pour les negatifs et SVA pour les nombres positifs
