m/crystal/uni_notes/architecture.html
<div id="outline-container-orgb2d4951" class="outline-4">
<h4 id="orgb2d4951">Remarque</h4>
<div class="outline-text-4" id="text-orgb2d4951">
<p>
Quelque soit le codage utilise, par convention le dernier bit est reserve pour le signe. ou 1 est negatif et 0 est positif.<br />
</p>
</div>
</div>
<div id="outline-container-orgca1d761" class="outline-4">
<h4 id="orgca1d761">Le codage en signe + valeur absolue (SVA):</h4>
<div class="outline-text-4" id="text-orgca1d761">
<p>
Avec n bits le n eme est reserve au signe : [-(2^n-1)-1 , 2^n-1 -1]. Sur 8bits [-127, 127]<br />
</p>
</div>
</div>
<div id="outline-container-orgd2c678f" class="outline-4">
<h4 id="orgd2c678f">Codage en compliment a 1 (CR):</h4>
<div class="outline-text-4" id="text-orgd2c678f">
<p>
On obtiens le compliment a 1 d&rsquo;un nombre binaire en inversant chaqu&rsquo;un de ses bits (1 -&gt; 0 et 0-&gt; 1) les nombres positifs sont la meme que SVA (il reste tel qu&rsquo;il est)<br />
</p>
</div>
</div>
<div id="outline-container-org9961620" class="outline-4">
<h4 id="org9961620">Codage en compliment a 2 (CV):</h4>
<div class="outline-text-4" id="text-org9961620">
<p>
C&rsquo;est literallement CR + 1 pour les negatifs et SVA pour les nombres positifs<br />
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Crystal</p>
<p class="date">Created: 2023-11-01 Wed 20:16</p>
</div>
</body>
</html>